{
    "popup-d":                              "Actualmente estoy buscando un contrato de aprendizaje (elegible para la ayuda de 6000 euros) de al menos un a침o de duraci칩n! 游땕 춰Gracias por compartir y ayudarme a encontrar esta oportunidad! 游游똂",
    "home-title-p":                         "Acerca de",
    "home-presentation-p":                  "Tengo 29 a침os y siempre he estado apasionado por las matem치ticas y la inform치tica. Curioso y 치vido de conocimiento, tengo excelentes habilidades interpersonales y s칠 trabajar en equipo. Al acercarme a los 30 a침os, siento la necesidad de cambiar a un campo que siempre ha sido el m칤o: la programaci칩n. Te invito a disfrutar explorando este portafolio.",
    "home-work-title-p":                    "Mi Trabajo",
    "home-work-card-title-dev":             "Desarrollo",
    "home-work-card-content-dev":           "Como desarrollador, me cautiva el poder y la flexibilidad de los lenguajes de alto nivel. Con una s칩lida formaci칩n en lenguajes de bajo nivel, estoy ansioso por nuevos proyectos.",
    "home-work-card-title-math":            "Matem치ticas",
    "home-work-card-content-math":          "Mis habilidades en matem치ticas son un activo valioso como desarrollador. Me permiten comprender y resolver problemas complejos con rigor y precisi칩n.",
    "home-work-card-title-debug":           "Depuraci칩n",
    "home-work-card-content-debug":         "Me encanta depurar porque me permite entender profundamente c칩mo funciona el c칩digo. Cada error es un desaf칤o a resolver, estimulando mi curiosidad y mente anal칤tica.",
    "home-work-card-title-com":             "Comunicaci칩n",
    "home-work-card-content-com":           "Compartir y aprender son para m칤 fuentes de gran satisfacci칩n. Disfruto inmensamente compartiendo con los dem치s y valoro cada oportunidad para enriquecer mis conocimientos.",

    "resume-title-p":                       "Curr칤culum",
    "resume-formation-title-p":             "Educaci칩n",
    "resume-formation-card-HS-I":           "Diploma de Bachillerato",
    "resume-formation-card-HS-II":          "Ciencias",
    "resume-formation-card-42-I":           "42 Par칤s",
    "resume-formation-card-42-II":          "Ciencias Inform치ticas",
    "resume-formation-card-IPSSI-I":        "Licenciatura - IPSSI",
    "resume-formation-card-42-IPSII-II":    "Desarrollo Full Stack y DevOps",
    "resume-formation-card-AMU-I":          "Licenciatura en Matem치ticas e Inform치tica",
    "resume-formation-card-AMU-II":         "Universidad de Aix-Marsella",
    "resume-interest-title":                "Intereses",
    "resume-interest-I":                    "Escultismo",
    "resume-interest-II":                   "Matem치ticas",
    "resume-interest-III":                  "Juegos de Rol",
    "resume-interest-IV":                   "Hip-Hop",
    "resume-interest-V":                    "Ajedrez",
    "resume-interest-VI":                   "Ciclismo",
    "resume-interest-VII":                  "Guitarra",
    "resume-interest-VIII":                 "Cocina",
    "resume-interest-IX":                   "Educaci칩n",
    "resume-interest-X":                    "Electr칩nica",
    "resume-interest-XI":                   "Gimnasia",
    "resume-interest-XII":                  "Tango",
    "resume-interest-XIII":                 "Teatro",
    "resume-interest-XIV":                  "Ciencia Ficci칩n",
    "resume-interest-XV":                   "Senderismo",
    "resume-interest-XVI":                  "Zetetismo",
    "resume-interest-XVII":                 "F칤sica",
    "resume-interest-XVIII":                "Excel",
    "resume-interest-XIX":                  "Puzzles",
    "resume-interest-XX":                   "Podcasts",
    "resume-interest-XXI":                  "T칠",

    "skills-title-p":                       "Habilidades",
    "skills-card-title-web":               "Desarrollo Web",
    "skills-card-title-app":               "Desarrollo de Aplicaciones",
    "skills-card-title-tools":             "Herramientas",
    "skills-card-title-other":             "Habilidades Amplias",
    "skills-card-other-sub-com":           "Comunicaci칩n",
    "skills-card-other-sub-listen":        "Escucha",

    "projects-title-p":                     "Proyectos",
    "libgraphic-content":                   "Desarrollo de libgraphic en C, una biblioteca gr치fica para crear renders 2D y 3D, animaciones e interacciones visuales.",
    "fdf-content":                          "Visor de wireframe que lee heightmaps y genera representaciones 3D detalladas del terreno, permitiendo una exploraci칩n interactiva.",
    "raytracer-content":                    "Raytracer b치sico que crea im치genes 3D realistas con sombras, reflejos y refracciones trazando rayos de luz.",
    "wolf3D-content":                       "R칠plica de Wolfenstein usando raycasting, con gr치ficos retro y jugabilidad fluida, incluyendo una gesti칩n de colisiones inmersiva.",
    "bot-content":                          "Creaci칩n de bots con Selenium para automatizar tareas en LinkedIn, Instagram y Pronote, recopilando datos y gestionando acciones repetitivas.",
    "axaunot-content":                      "Gestor para PYMES, similar a Axaunot, que maneja cotizaciones, clientes, inventario, tickets y tareas. Integra esc치neres para un seguimiento en tiempo real del inventario.",
    "arina-content":                        "Arina es un juego t치ctico inspirado en Final Fantasy Tactics, centrado en combates por turnos y creaci칩n de equipos.",
    "dofus-content":                        "Analizador de mercado para Dofus, recopilando recetas, recursos y precios. Optimiza los gastos y maximiza las ganancias.",
    "libc-content":                         "Creaci칩n de una versi칩n personalizada de libc, reescribiendo funciones esenciales como la gesti칩n de memoria y las operaciones de E/S.",
    "ls-content":                           "Reimplementaci칩n del comando 'ls' de Unix/Linux, listando archivos y directorios con varias opciones. Demuestra un dominio de los sistemas de archivos en C.",
    "minishell-content":                    "Creaci칩n de un mini shell para ejecutar comandos b치sicos y gestionar procesos y manipulaci칩n de E/S.",
    "corewar-content":                      "Implementaci칩n de Corewar, un juego donde programas guerreros se enfrentan en memoria virtual manipulando la memoria compartida.",
    "Lemin-content":                        "Creaci칩n de un simulador de gesti칩n de hormiguero, optimizando la ruta de las hormigas a trav칠s de salas y t칰neles utilizando algoritmos de grafos.",
    "ia-content":                           "Creaci칩n de IA b치sicas para Conecta 4, laberintos y Fillit. Analiza movimientos, encuentra el camino m치s corto y optimiza la colocaci칩n de piezas.",

    "main-menu-list-element-home-p":        "Inicio",
    "main-menu-list-element-resume-p":      "Curr칤culum",
    "main-menu-list-element-skills-p":      "Habilidades",
    "main-menu-list-element-project-p":     "Proyectos",

    "side-core-job-p":                      "Desarrollador",
    "side-core-cv-button-p":                "Descargar mi CV"
}
