{
    "popup-d":                              "Je suis actuellement à la recherche d'un contrat d'apprentissage (éligible à l'aide de 6000 euros) d'une durée d'un an minimum ! 😊 Merci de partager et m'aider à trouver cette opportunité ! 🚀🙏",
    "home-title-p":                         "A Propos",
    "home-presentation-p":                  "  J’ai 29 ans, et j’ai toujours été passionné par les mathématiques et l’informatique. Curieux et avide de connaissances, j’ai un excellent relationnel et je sais travailler en équipe. À l’aube de mes 30 ans, je ressens le besoin de me reconvertir vers un domaine qui, au fond, a toujours été le mien : la programmation. Je vous laisse le plaisir de parcourir ce portfolio.",
    "home-work-title-p":                    "Mon travail",
    "home-work-card-title-dev":             "Développement",
    "home-work-card-content-dev":           "En tant que développeur, je suis captivé par la puissance et la flexibilité des langages de haut niveau. Ayant un solide bagage en langages de bas niveau, je suis avide de nouveaux projets.",
    "home-work-card-title-math":            "Mathématiques",
    "home-work-card-content-math":          "Mes compétences en mathématiques sont un atout précieux en tant que développeur. Elles me permettent de comprendre et de résoudre des problèmes complexes avec rigueur et précision.",
    "home-work-card-title-debug":           "Deboguage",
    "home-work-card-content-debug":         "J'aime déboguer car cela me permet de comprendre en profondeur le fonctionnement du code. Chaque bug est un défi à résoudre, stimulant ma curiosité et mon esprit analytique.",
    "home-work-card-title-com":             "Communication",
    "home-work-card-content-com":           "Partager et apprendre sont pour moi des sources de grande satisfaction. J'éprouve une immense joie à partager avec les autres et je valorise également chaque opportunité d'enrichir mes connaissances.",

    "resume-title-p":                       "Parcours",
    "resume-formation-title-p":             "Education",
    "resume-formation-card-HS-I":           "Baccalauréat",
    "resume-formation-card-HS-II":          "Filière S",
    "resume-formation-card-42-I":           "42 Paris",
    "resume-formation-card-42-II":          "Sciences Informatiques",
    "resume-formation-card-IPSSI-I":        "Bachelor - IPSSI",
    "resume-formation-card-42-IPSII-II":    "Développement full stack et DevOps",
    "resume-formation-card-AMU-I":          "Licence Mathématique Informatique",
    "resume-formation-card-AMU-II":         "Aix Marseille Université",
    "resume-interest-title":                "Centre d'Intérêts",
    "resume-interest-I":                    "Scoutisme",
    "resume-interest-II":                   "Mathématiques",
    "resume-interest-III":                  "Jeux de Rôle",
    "resume-interest-IV":                   "Hip-Hop",
    "resume-interest-V":                    "Echecs",
    "resume-interest-VI":                   "Vélo",
    "resume-interest-VII":                  "Guitare",
    "resume-interest-VIII":                 "Cuisine",
    "resume-interest-IX":                   "Education",
    "resume-interest-X":                    "Electronique",
    "resume-interest-XI":                   "Gymnastique",
    "resume-interest-XII":                  "Tango",
    "resume-interest-XIII":                 "Théatre",
    "resume-interest-XIV":                  "Sci-Fi",
    "resume-interest-XV":                   "Randonnée",
    "resume-interest-XVI":                  "Zéthétique",
    "resume-interest-XVII":                 "Physique",
    "resume-interest-XVIII":                 "Excel",
    "resume-interest-XIX":                  "Puzzle",
    "resume-interest-XX":                   "Podcast",
    "resume-interest-XXI":                  "Thé",

    "skills-title-p":                       "Compétences",
    "skills-card-title-web":               "Développement Web",
    "skills-card-title-app":               "Développement App",
    "skills-card-title-tools":             "Outils",
    "skills-card-title-other":             "Compétences Elargies",
    "skills-card-other-sub-com":           "Communication",
    "skills-card-other-sub-listen":        "Ecoute",

    "projects-title-p":                     "Projets",
    "libgraphic-content":                   "Développement de libgraphic en C, une bibliothèque graphique pour créer des rendus 2D et 3D, animations et interactions visuelles.",
    "fdf-content":                          "Visualiseur de wireframe lisant des ‘heightmaps’ et générant des représentations 3D détaillées des terrains, permettant une exploration interactive.",
    "raytracer-content":                    "Raytracer basique créant des images 3D réalistes avec ombres, réflexions et réfractions en traçant les rayons de lumière.",
    "wolf3D-content":                       "Réplique de Wolfenstein utilisant le raycasting, avec graphismes rétro et gameplay fluide et gestion des collisions immersive.",
    "bot-content":                          "Création de bots Selenium pour automatiser des tâches sur LinkedIn, Instagram et Pronote, collectant des données et gérant des actions répétitives.",
    "axaunot-content":                      "Gestionnaire pour PME, similaire à Axaunot, avec gestion des devis, clients, inventaire, tickets et tâches. Intègre des scanners pour un suivi des stocks en temps réel.",
    "arina-content":                        "Arina est un jeu tactique inspiré de Final Fantasy Tactics, centré sur les combats au tour par tour et la création d’équipes.",
    "dofus-content":                        "Analyseur de marché pour Dofus, collectant recettes, ressources et prix. Optimise les dépenses et maximise les gains.",
    "libc-content":                         "Création d'une version personnalisée de la libc, réécrivant des fonctions essentielles comme la gestion de la mémoire et les entrées/sorties.",
    "ls-content":                           "Réimplémentation de la commande 'ls' d'Unix/Linux, listant fichiers et répertoires avec diverses options. Montre une maîtrise des systèmes de fichiers en C.",
    "minishell-content":                    "Création d'un mini shell pour exécuter des commandes de base et gérer les processus et manipulation des E/S.",
    "corewar-content":                      "Implémentation de Corewar, un jeu où des programmes guerriers s'affrontent en mémoire virtuelle en manipulant la mémoire partagée.",
    "Lemin-content":                        "Création d'un simulateur de gestion de fourmilière, optimisant le trajet des fourmis à travers des salles et tunnels grâce à des algorithmes de graphes.",
    "ia-content":                           "Création d'IA basiques pour Puissance 4, labyrinthes et Fillit. Analyse les coups, trouve le chemin le plus court et optimise le placement des pièces.",

    "main-menu-list-element-home-p":        "Accueil",
    "main-menu-list-element-resume-p":      "Parcours",
    "main-menu-list-element-skills-p":      "Compétences",
    "main-menu-list-element-project-p":     "Projets",

    "side-core-job-p":                      "Développeur",
    "side-core-cv-button-p":                "Télécharger mon CV"
}